In [1]:
import numpy as np

In [2]:
a=np.array([1,2,3,4,5])
print(a)

[1 2 3 4 5]

In [3]:
import pandas as pd

In [4]:
dict_data={'a':1,'b':2,'c':3}
sr=pd.Series(dict_data)
print(type(sr))
print('-'*30)
print(sr)

<class 'pandas.core.series.Series'>
------------------------------
a    1
b    2
c    3
dtype: int64

In [5]:
print(sr.index)
print('-'*30)
print(sr.values)

Index(['a', 'b', 'c'], dtype='object')
------------------------------
[1 2 3]

In [6]:
list_data=['2019-01-02',3.14,'ABC',100,True]
sr=pd.Series(list_data)
print(sr)

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [7]:
dict_data={'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}
df=pd.DataFrame(dict_data)
print(df)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [9]:
df=pd.DataFrame([[15,'남','덕영중'], [17,'여','수리중']], index=['준서','예은'], columns=['나이','성별','학교'])
print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [11]:
df=pd.DataFrame([['John',44445555,'Male','LA'],['Jame',43215432,'Female','LV'],['Jacob',77778888,'Male','NY'],['Johanson',12345432,'Female','Mi']]
               , index=['First','Second','Third','Fourth'], columns=['Name','Mobile','Gender','City'])
print(df)

            Name    Mobile  Gender City
First       John  44445555    Male   LA
Second      Jame  43215432  Female   LV
Third      Jacob  77778888    Male   NY
Fourth  Johanson  12345432  Female   Mi

In [12]:
df.index=['1st','2nd','3th','4th']
print(df)

         Name    Mobile  Gender City
1st      John  44445555    Male   LA
2nd      Jame  43215432  Female   LV
3th     Jacob  77778888    Male   NY
4th  Johanson  12345432  Female   Mi

In [13]:
df.columns=['이름','모바일','성별','도시']
print(df)

           이름       모바일      성별  도시
1st      John  44445555    Male  LA
2nd      Jame  43215432  Female  LV
3th     Jacob  77778888    Male  NY
4th  Johanson  12345432  Female  Mi

In [18]:
df.rename(index={'1st':'첫째','2nd':'둘째', '3th':'셋째'})

           이름       모바일      성별  도시
첫째       John  44445555    Male  LA
둘째       Jame  43215432  Female  LV
셋째      Jacob  77778888    Male  NY
4th  Johanson  12345432  Female  Mi

In [19]:
df.rename(columns={'도시':'City','모바일':'Mobile','성별':'Gender'})

           이름    Mobile  Gender City
1st      John  44445555    Male   LA
2nd      Jame  43215432  Female   LV
3th     Jacob  77778888    Male   NY
4th  Johanson  12345432  Female   Mi

In [20]:
df.drop('2nd')

           이름       모바일      성별  도시
1st      John  44445555    Male  LA
3th     Jacob  77778888    Male  NY
4th  Johanson  12345432  Female  Mi

In [21]:
df.drop(['2nd','3th'])

           이름       모바일      성별  도시
1st      John  44445555    Male  LA
4th  Johanson  12345432  Female  Mi

In [22]:
df.drop(['모바일','도시'],axis=1)

           이름      성별
1st      John    Male
2nd      Jame  Female
3th     Jacob    Male
4th  Johanson  Female

In [25]:
df

           이름       모바일      성별  도시
1st      John  44445555    Male  LA
2nd      Jame  43215432  Female  LV
3th     Jacob  77778888    Male  NY
4th  Johanson  12345432  Female  Mi

In [26]:
df.loc['2nd']

이름         Jame
모바일    43215432
성별       Female
도시           LV
Name: 2nd, dtype: object

In [27]:
df.iloc[3]

이름     Johanson
모바일    12345432
성별       Female
도시           Mi
Name: 4th, dtype: object

In [29]:
df[['모바일','이름']]

          모바일        이름
1st  44445555      John
2nd  43215432      Jame
3th  77778888     Jacob
4th  12345432  Johanson

In [30]:
exam_data={'이름':['서준','우현','인아'],'수학':[90,80,70],'영어':[98,89,95],'음악':[85,95,100],'체육':[100,90,90]}

In [32]:
df=pd.DataFrame(exam_data)
print(df)

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [35]:
df.iloc[:3:2]

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
2  인아  70  95  100   90

In [36]:
df.loc[0,'영어']

98

In [38]:
df.iloc[0,2]

98

In [40]:
df.iloc[2,[2,3]]

영어     95
음악    100
Name: 2, dtype: object

In [42]:
df.iloc[[0,2],[3,4]]

    음악   체육
0   85  100
2  100   90

In [45]:
df.loc[[0,2],['음악','체육']]

    음악   체육
0   85  100
2  100   90

In [46]:
df['국어']=0 # 없으면 새로 만들고

In [47]:
df

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100   0
1  우현  80  89   95   90   0
2  인아  70  95  100   90   0

In [48]:
df.loc[3]=['',0,0,0,0,0]
print(df)

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100   0
1  우현  80  89   95   90   0
2  인아  70  95  100   90   0
3       0   0    0    0   0

In [50]:
df.transpose()

      0   1    2  3
이름   서준  우현   인아
수학   90  80   70  0
영어   98  89   95  0
음악   85  95  100  0
체육  100  90   90  0
국어    0   0    0  0

In [52]:
df.T

      0   1    2  3
이름   서준  우현   인아
수학   90  80   70  0
영어   98  89   95  0
음악   85  95  100  0
체육  100  90   90  0
국어    0   0    0  0

In [53]:
df.set_index('이름')

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100   0
우현  80  89   95   90   0
인아  70  95  100   90   0
     0   0    0    0   0

In [57]:
df.reindex(['r0','r1','r2','r3','r4'])

     이름  수학  영어  음악  체육  국어
r0  NaN NaN NaN NaN NaN NaN
r1  NaN NaN NaN NaN NaN NaN
r2  NaN NaN NaN NaN NaN NaN
r3  NaN NaN NaN NaN NaN NaN
r4  NaN NaN NaN NaN NaN NaN

In [58]:
dict_data={'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

In [66]:
df=pd.DataFrame(dict_data,index=['r0','r1','r2'])

In [67]:
print(df)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [70]:
ndf=df.reindex(['r0','r1','r2','x3','x4'],fill_value=0)

In [71]:
print(ndf)

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
x3   0   0   0   0   0
x4   0   0   0   0   0

In [73]:
ndf.sort_index(ascending=False)

    c0  c1  c2  c3  c4
x4   0   0   0   0   0
x3   0   0   0   0   0
r2   3   6   9  12  15
r1   2   5   8  11  14
r0   1   4   7  10  13

In [76]:
student1=pd.Series({'국어':100,'영어':80,'수학':90})
print(student1*3)

국어    300
영어    240
수학    270
dtype: int64

In [77]:
print(student1/200)

국어    0.50
영어    0.40
수학    0.45
dtype: float64

In [84]:
student2=pd.Series({'국어':90,'수학':80})
print(student1-student2)
print(student1.div(student2,fill_value=0))

국어    10.0
수학    10.0
영어     NaN
dtype: float64
국어    1.111111
수학    1.125000
영어         inf
dtype: float64

In [85]:
import seaborn as sns

In [87]:
titanic=sns.load_dataset('titanic')
df=titanic.loc[:,['age','fare']]
print(df)
print('-'*30)
print(df*3)

      age     fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
886  27.0  13.0000
887  19.0  30.0000
888   NaN  23.4500
889  26.0  30.0000
890  32.0   7.7500

[891 rows x 2 columns]
------------------------------
       age      fare
0     66.0   21.7500
1    114.0  213.8499
2     78.0   23.7750
3    105.0  159.3000
4    105.0   24.1500
..     ...       ...
886   81.0   39.0000
887   57.0   90.0000
888    NaN   70.3500
889   78.0   90.0000
890   96.0   23.2500

[891 rows x 2 columns]

In [89]:
df1=pd.DataFrame({'a':[0,1,2],'b':[3,4,5]})
df2=pd.DataFrame({'a':[0,1,2,3],'c':[6,7,8,9]})
print(df1+df2)

     a   b   c
0  0.0 NaN NaN
1  2.0 NaN NaN
2  4.0 NaN NaN
3  NaN NaN NaN